# Задача 1. Сформуйте стрінг, в якому міститься інформація про певне слово. "Word [тут слово] has [тут довжина слова, отримайте з самого сдлва] letters", наприклад "Word 'Python' has 6 letters". 
# Для отримання слова для аналізу скористайтеся константою або функцією input().

str_word = "Guitar"
length = len(str_word) # Вимірює довжинну слова у змінній str_word
text = f"Word '{str_word}' has {length} letters"
print(text) # Виводить відформатований текст у змінній text

print("\n--------------------------------\n")

# Задача 2. Напишіть программу "Касир в кінотеватрі", яка попросіть користувача ввести свсвій вік (можно використати константу або функцію input(), 
# на екран має бути виведено лише одне повідомлення, також подумайте над варіантами, коли введені невірні дані).

age = input("Hello, please enter your age: ")

if age.isdigit():
    int_age = int(age)
    str_age = str(age)
    if int_age < 7:
        print("Where your perents?") # якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
    elif int_age < 16:
        print("This movie for adults!") # якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
    elif int_age > 65:
        print("Show your pension certificate!") # якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
    elif '7' in str_age:
        print("You will be lucky today!") # якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"
    else:
        print("And there are no more tickets!") # у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"
else:
    print("Error! Please enter the age!")       
